app/views/trainings/_form_attributes.html.erb

SELECT "equipment".* FROM "equipment"
---
    <%= f.label :equipment %>
    <%= f.collection_select(:equipment_id, Equipment.all, :id, :name) %>