app/views/equipment/index.html.erb

    <p>
    <%= link_to "#{equipment.reports.count} Reports", equipment_reports_path(equipment) %>
---
SELECT COUNT(*) FROM "reports" WHERE "reports"."equipment_id" = ?  [["equipment_id", 1]]