app/controllers/equipment_controller.rb

SELECT "equipment".* FROM "equipment"
---
    def index
        @equipment_index = Equipment.all

INSERT INTO "equipment" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "CPR Manikin 4"], ["created_at", "2018-08-08 18:43:45.914718"], ["updated_at", "2018-08-08 18:43:45.914718"]]
---
    def create
        @equipment = Equipment.new(equipment_params)
        if @equipment.save