app/controllers/reports_controller.rb

SELECT  "equipment".* FROM "equipment" WHERE "equipment"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def index
        @equipment = Equipment.find(params[:equipment_id])

SELECT  "equipment".* FROM "equipment" WHERE "equipment"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def new
        @equipment = Equipment.find(params[:equipment_id])

INSERT INTO "reports" ("content", "equipment_id", "created_at") VALUES (?, ?, ?)  [["content", "this is a report to test simroom's awesomeness\r\n"], ["equipment_id", 1], ["created_at", "2018-11-15 01:36:46.881002"]]
SELECT  "equipment".* FROM "equipment" WHERE "equipment"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def create
        @report = Report.new(:content => params[:report][:content], :equipment_id => params[:equipment_id])
        if @report.save
            redirect_to equipment_reports_path(@report.equipment)
        else
            @equipment = Equipment.find(params[:equipment_id])