app/controllers/sessions_controller.rb

    def create
        if auth_hash = request.env["omniauth.auth"]
            @user = User.find_or_create_by_omniauth(auth_hash)
            session[:user_id] = @user.id
            redirect_to user_path(@user)
        else
            @user = User.find_by(:email => params[:user][:email])
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "akadel01@gmail.com"], ["LIMIT", 1]]