app/controllers/trainings_controller.rb

SELECT "trainings".* FROM "trainings"
---
    def index
        @trainings = Training.all

INSERT INTO "trainings" ("name", "description", "date", "simroom", "user_id", "equipment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @training = Training.new(training_params)
        if @training.save

SELECT  "trainings".* FROM "trainings" WHERE "trainings"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def show # allows rails to serve either html or json response from same endpoint
        @training = Training.find(params[:id])

SELECT  "trainings".* FROM "trainings" WHERE "trainings"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def edit
        @training = Training.find(params[:id])

SELECT  "trainings".* FROM "trainings" WHERE "trainings"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "trainings" SET "description" = ?, "updated_at" = ? WHERE "trainings"."id" = ?  [["description", "i am editing the description!"], ["updated_at", "2018-08-08 17:37:13.144015"], ["id", 5]]
---
    def update
        @training = Training.find(params[:id])
        if @training.update(training_params) && admin?

SELECT  "trainings".* FROM "trainings" WHERE "trainings"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
---
    def next
        @training = Training.find(params[:id])

SELECT  "trainings".* FROM "trainings" WHERE "trainings"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
DELETE FROM "trainings" WHERE "trainings"."id" = ?  [["id", 26]]
---
    def destroy
        @training = Training.find(params[:id])
        @training.destroy if admin?