app/models/training.rb

SELECT  "trainings".* FROM "trainings" WHERE (id > 20) ORDER BY "trainings"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "trainings".* FROM "trainings" ORDER BY "trainings"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def next
        training = Training.where("id > ?", id).first

        if training
            training
        else
            Training.first