app/models/user.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "allisonkadel"], ["LIMIT", 1]]
---
    def self.find_or_create_by_omniauth(auth_hash)
        self.where(:email => auth_hash["info"]["nickname"]).first_or_create do |user|